flix/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = 9  [["description", "The Dark Knight of Gotham City begins his war on crime with his first major enemy being the clownishly homicidal Joker."], ["updated_at", "2015-09-30 12:54:15.965032"]]
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)